/*******************************************************************************************************
*Copyright (C), 2016, Shanghai Eastsoft Microelectronics Co., Ltd   
*	模块名称 : 公共函数模块。
*	文件名称 :common.c
*	版    本 : V1.0
*	描    述 ：
*	日    期 ：2016\12\29             
*	修改记录 :
*			作者	版本	说明
*			
* 本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************************************************************/
#include "includes.h"
/*
*********************************************************************************************************
*	函 数 名: HexToBcd
*	功能说明: HEX码转换为BCD    
*	形    参: 要转换的值 
*	返 回 值: 转换值  
*********************************************************************************************************
*/
uint8_t HexToBcd( uint8_t value ) 
{
    return ( ((value/10) << 4) + (value % 10) );
}
/*
*********************************************************************************************************
*	函 数 名: BcdToHex
*	功能说明: BCD码转换为HEX    
*	形    参: 要转换的值   
*	返 回 值: 转换值   
*********************************************************************************************************
*/
uint8_t BcdToHex( uint8_t value ) 
{
    return ( ((value&0xF0) >> 4) * 10 + (value & 0x0F) );
}
/*
*********************************************************************************************************
*	函 数 名: Hex2Bcd
*	功能说明: 将多字节HEX码转换为BCD      
*	形    参: 要转换的HEX及长度      
*	返 回 值: 
*********************************************************************************************************
*/
void Hex2Bcd( uint8_t *Hexopt, uint8_t *BCDopt, uint8_t Len ) //要求Len不能大于8
{ 
    uint8_t ucA,ucB;
    B32_B08 TempHex;
  
    TempHex.B32 = 0;
    for (ucA=0; ucA<Len; ucA++)
    { 
        TempHex.B08[ucA] = Hexopt[ucA];
    }
    
    for (ucA=0; ucA<Len; ucA++)
    {
        ucB = TempHex.B32%100;
        BCDopt[ucA] = HexToBcd(ucB);
        TempHex.B32 = TempHex.B32/100;
    }   
}
/*
*********************************************************************************************************
*	函 数 名: Bcd2Hex
*	功能说明: 将多字节BCD码转换为HEX      
*	形    参: 要转换的BCD及长度           
*	返 回 值: 
*********************************************************************************************************
*/
void Bcd2Hex( uint8_t *BCDopt, uint8_t *HEXopt, uint8_t Len ) 
{
    uint8_t ucA;
    unsigned long bai_n;
    B32_B08 TempHex;
   
    TempHex.B32 = 0;
    bai_n = 1;
    for (ucA=0; ucA<Len; ucA++)
    {
        TempHex.B32 += bai_n * ((BCDopt[ucA] >> 4 ) * 10 + (BCDopt[ucA] & 0x0F));
        bai_n *= 100;
    }
    for (ucA=0; ucA<Len; ucA++)
    { 
        HEXopt[ucA] = TempHex.B08[ucA];
    }
}

/*********************************************************
函数名：Hex2Bcd_4                 
描  述：将4字节HEX码转换为BCD
输入值：要转换的HEX
输出值: BCD
返回值：无                                        
*********************************************************/
void Hex2Bcd_4(uint8_t *HEXopt, uint8_t *BCDopt)
{
    Hex2Bcd( HEXopt, BCDopt, 4 );
}

/*********************************************************
函数名：Bcd2Hex_4                       
描  述：将4字节BCD码转换为HEX                  
输入值：要转换的BCD，                                         
输出值: HEX
返回值：无                                        
*********************************************************/
void Bcd2Hex_4(uint8_t *BCDopt, uint8_t *HEXopt)
{
    Bcd2Hex( BCDopt, HEXopt, 4 );  
}

/*
*********************************************************************************************************
*	函 数 名: CheckOddEven
*	功能说明: 判断数据奇偶。
*	形    参:  待判断数据
*	返 回 值: 奇偶位
*********************************************************************************************************
*/
uint8_t CheckOddEven ( uint8_t Data )
{
    uint8_t i, j;
    j = 0;
    for ( i = 0; i < 8; i++ )
    {
        if ( Data & 0x01 )
        {
            j++;
        }
        Data = Data >> 1;
    }
    return ( j );
}
/*
*********************************************************************************************************
*	函 数 名: CheckOddEven
*	功能说明: 延时1ms函数
*	形    参:  延时时间。单位ms。
*	返 回 值: 
*********************************************************************************************************
*/
void DelayMs(uint16_t m)
{
	uint16_t i;
	
	while (m--)
	{
		for (i=0; i<1124; i++);
	}
} 
/*
*********************************************************************************************************
*	函 数 名: SumCheck
*	功能说明: 校验和
*	形    参:  data 待校验数据指针 num 带校验的数据个数
*	返 回 值: 校验和
*********************************************************************************************************
*/
uint16_t SumCheck(uint8_t* data, uint8_t num)
{
	uint16_t check = 0;
	uint8_t	i;
	
	for (i=0; i<num; i++)
	{
		if (i%2)
			check += ((uint16_t)data[i] << 8);
		else
			check += data[i];
	}
	return check;
}
